# Code Example

.head()

In [2]:
import pandas as pd

data = {
    'Name' : ['Bud','Anna','Payton','Darian'],
    'Age' : [25,37,12,98],
    'Salary' : [60000,57000,85000,120000]
}

#creat dataframe

df = pd.DataFrame(data)
print(df)

print('\n')
# Get a nice table
df.head()

     Name  Age  Salary
0     Bud   25   60000
1    Anna   37   57000
2  Payton   12   85000
3  Darian   98  120000

     Name  Age  Salary
0     Bud   25   60000
1    Anna   37   57000
2  Payton   12   85000
3  Darian   98  120000

In [6]:
df2 = df[['Name','Salary']]
print(df[['Name','Salary']])
print(f'\n {df2.head()}')

     Name  Salary
0     Bud   60000
1    Anna   57000
2  Payton   85000
3  Darian  120000

      Name  Salary
0     Bud   60000
1    Anna   57000
2  Payton   85000
3  Darian  120000